ppio/reasoning_result.txt
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='random', dataset_path=None, max_concurrency=16, model='deepseek-r1', tokenizer='/root/DeepSeek-R1-0528-Qwen3-8B', best_of=1, use_beam_search=False, num_prompts=32, logprobs=None, request_rate=inf, burstiness=1.0, seed=42, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=5734, random_output_len=1434, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
5961
5968
5929
5933
5904
5953
5927
5930
5938
5910
5936
5943
5922
5943
5934
5938
5929
5934
5920
5930
5947
5937
5915
5949
5942
5976
5945
5929
5947
5948
5940
5949
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
============ Serving Benchmark Result ============
Successful requests:                     32        
Benchmark duration (s):                  280.37    
Total input tokens:                      190006    
Total generated tokens:                  45888     
Request throughput (req/s):              0.11      
Output token throughput (tok/s):         163.67    
Total Token throughput (tok/s):          841.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          79796.38  
Median TTFT (ms):                        105889.43 
P99 TTFT (ms):                           107063.58 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.96     
Median TPOT (ms):                        24.03     
P99 TPOT (ms):                           24.07     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.96     
Median ITL (ms):                         22.80     
P99 ITL (ms):                            23.32     
==================================================